#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fiap-postech-soat1-group21/restaurant/runs/run-8KTELePCwRb5qeqQ

Waiting for the plan to start...

Terraform v1.6.2
on linux_amd64
Initializing plugins and modules...
data.archive_file.function_archive: Refreshing...
aws_route_table_association.private-us-east-1a: Refreshing state... [id=rtbassoc-02b441d933cd3f75e]
aws_route_table_association.public-us-east-1a: Refreshing state... [id=rtbassoc-099f2c4e17293d387]
aws_eip.nat: Refreshing state... [id=eipalloc-00676bf06d5d67496]
aws_route_table_association.public-us-east-1b: Refreshing state... [id=rtbassoc-0a9a82ca51b57ba89]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=restaurant-ecsTaskExecutionRole-20231105182404470200000002]
aws_nat_gateway.nat: Refreshing state... [id=nat-098a61e6017d8e254]
aws_ecs_cluster.cluster_name: Refreshing state... [id=arn:aws:ecs:us-east-1:731771597147:cluster/restaurant-cluster]
aws_subnet.private-us-east-1b: Refreshing state... [id=subnet-081509cef4e929d47]
aws_security_group.alb_sg: Refreshing state... [id=sg-0bc6b3e1d0c9a4da8]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:731771597147:loadbalancer/app/restaurant-alb/abeaa18aec9b0d35]
aws_route_table_association.private-us-east-1b: Refreshing state... [id=rtbassoc-090204f224b6a5312]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:731771597147:listener/app/restaurant-alb/abeaa18aec9b0d35/892a6f12ea76dd03]
aws_ecs_task_definition.this: Refreshing state... [id=restaurant-task-definition]
aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:us-east-1:731771597147:service/restaurant-cluster/restaurant-cluster-service]
aws_route_table.public: Refreshing state... [id=rtb-0ef554af3a7623de7]
aws_route_table.private: Refreshing state... [id=rtb-09afe03b2ce6656fe]
aws_subnet.public-us-east-1a: Refreshing state... [id=subnet-048a01da1eaaa9627]
data.archive_file.function_archive: Refresh complete after 0s [id=f57f884943ffc2ca575924bf576a6c681af504b9]
aws_ecr_repository_policy.policy: Refreshing state... [id=restaurant-ecr-cluster]
aws_security_group.service_sg: Refreshing state... [id=sg-02906763fc02f0428]
aws_subnet.private-us-east-1a: Refreshing state... [id=subnet-0c547afae8ab7bc81]
aws_ecr_lifecycle_policy.policy: Refreshing state... [id=restaurant-ecr-cluster]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=restaurant-ecsTaskExecutionRole]
aws_service_discovery_http_namespace.this: Refreshing state... [id=ns-5sof4ijobvtuqbhf]
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:731771597147:targetgroup/alb-target-gp/95b7466237ec27d7]
aws_internet_gateway.igw: Refreshing state... [id=igw-0c680a06ddaea0086]
aws_subnet.public-us-east-1b: Refreshing state... [id=subnet-0284ab38624aef72e]
aws_ecr_repository.ecr: Refreshing state... [id=restaurant-ecr-cluster]
aws_vpc.main: Refreshing state... [id=vpc-02f62adc57a97cda4]
aws_lb_listener.this: Drift detected (update)
aws_lb.this: Drift detected (update)
aws_security_group.service_sg: Drift detected (update)
aws_ecs_task_definition.this: Drift detected (update)
aws_nat_gateway.nat: Drift detected (update)
aws_security_group.alb_sg: Drift detected (update)
aws_iam_role.ecs_task_execution_role: Drift detected (update)
aws_service_discovery_http_namespace.this: Drift detected (update)
aws_eip.nat: Drift detected (update)
aws_lb_target_group.this: Drift detected (update)
aws_ecs_service.this: Drift detected (update)
aws_ecs_cluster.cluster_name: Drift detected (update)
aws_ecr_repository.ecr: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.policy will be destroyed
  # (because aws_ecr_lifecycle_policy.policy is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "policy" {
      - id          = "restaurant-ecr-cluster" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "last 10 docker images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber = 10
                          - countType   = "imageCountMoreThan"
                          - tagStatus   = "any"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "731771597147" -> null
      - repository  = "restaurant-ecr-cluster" -> null
    }

  # aws_ecr_repository.ecr will be destroyed
  # (because aws_ecr_repository.ecr is not in configuration)
  - resource "aws_ecr_repository" "ecr" {
      - arn                  = "arn:aws:ecr:us-east-1:731771597147:repository/restaurant-ecr-cluster" -> null
      - id                   = "restaurant-ecr-cluster" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "restaurant-ecr-cluster" -> null
      - registry_id          = "731771597147" -> null
      - repository_url       = "731771597147.dkr.ecr.us-east-1.amazonaws.com/restaurant-ecr-cluster" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # aws_ecr_repository_policy.policy will be destroyed
  # (because aws_ecr_repository_policy.policy is not in configuration)
  - resource "aws_ecr_repository_policy" "policy" {
      - id          = "restaurant-ecr-cluster" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:BatchGetImage",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:PutImage",
                          - "ecr:UploadLayerPart",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Sid       = "AllowPushPullImage"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - registry_id = "731771597147" -> null
      - repository  = "restaurant-ecr-cluster" -> null
    }

  # aws_ecs_cluster.cluster_name will be destroyed
  # (because aws_ecs_cluster.cluster_name is not in configuration)
  - resource "aws_ecs_cluster" "cluster_name" {
      - arn      = "arn:aws:ecs:us-east-1:731771597147:cluster/restaurant-cluster" -> null
      - id       = "arn:aws:ecs:us-east-1:731771597147:cluster/restaurant-cluster" -> null
      - name     = "restaurant-cluster" -> null
      - tags     = {} -> null
      - tags_all = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # aws_ecs_service.this will be destroyed
  # (because aws_ecs_service.this is not in configuration)
  - resource "aws_ecs_service" "this" {
      - cluster                            = "arn:aws:ecs:us-east-1:731771597147:cluster/restaurant-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 2 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 10 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:us-east-1:731771597147:service/restaurant-cluster/restaurant-cluster-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "restaurant-cluster-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:us-east-1:731771597147:task-definition/restaurant-task-definition:12" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = true -> null
          - rollback = true -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "restaurant-task-container" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:731771597147:targetgroup/alb-target-gp/95b7466237ec27d7" -> null
        }

      - network_configuration {
          - assign_public_ip = true -> null
          - security_groups  = [
              - "sg-02906763fc02f0428",
            ] -> null
          - subnets          = [
              - "subnet-0284ab38624aef72e",
              - "subnet-048a01da1eaaa9627",
            ] -> null
        }

      - service_connect_configuration {
          - enabled   = true -> null
          - namespace = "arn:aws:servicediscovery:us-east-1:731771597147:namespace/ns-5sof4ijobvtuqbhf" -> null

          - service {
              - discovery_name        = "restaurant-ecr" -> null
              - ingress_port_override = 0 -> null
              - port_name             = "restaurant-task-port" -> null

              - client_alias {
                  - dns_name = "restaurant-ecr" -> null
                  - port     = 8080 -> null
                }
            }
        }
    }

  # aws_ecs_task_definition.this will be destroyed
  # (because aws_ecs_task_definition.this is not in configuration)
  - resource "aws_ecs_task_definition" "this" {
      - arn                      = "arn:aws:ecs:us-east-1:731771597147:task-definition/restaurant-task-definition:12" -> null
      - arn_without_revision     = "arn:aws:ecs:us-east-1:731771597147:task-definition/restaurant-task-definition" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 1024
                  - environment      = [
                      - {
                          - name  = "API_PORT"
                          - value = "8080"
                        },
                      - {
                          - name  = "MYSQL_DSN"
                          - value = "restaurantuser:restaurantpass@tcp(restaurant.cjs7ovml0deq.us-east-1.rds.amazonaws.com:3306)/restaurant?multiStatements=true&&charset=utf8mb4&parseTime=True&loc=Local"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "wget --spider --server-response http://localhost:8080/api/v1/health || exit 1",
                        ]
                      - interval    = 10
                      - retries     = 5
                      - startPeriod = 30
                      - timeout     = 15
                    }
                  - image            = "restaurant-ecr-cluster:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "/ecs/restaurant-task-container"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 3072
                  - mountPoints      = []
                  - name             = "restaurant-task-container"
                  - portMappings     = [
                      - {
                          - appProtocol   = "http"
                          - containerPort = 8080
                          - hostPort      = 8080
                          - name          = "restaurant-task-port"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "1024" -> null
      - execution_role_arn       = "arn:aws:iam::731771597147:role/restaurant-ecsTaskExecutionRole" -> null
      - family                   = "restaurant-task-definition" -> null
      - id                       = "restaurant-task-definition" -> null
      - memory                   = "3072" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 12 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - task_role_arn            = "arn:aws:iam::731771597147:role/restaurant-ecsTaskExecutionRole" -> null

      - runtime_platform {
          - cpu_architecture        = "X86_64" -> null
          - operating_system_family = "LINUX" -> null
        }
    }

  # aws_eip.nat will be destroyed
  # (because aws_eip.nat is not in configuration)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-00676bf06d5d67496" -> null
      - association_id       = "eipassoc-0cf520b044cfaa1ed" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-00676bf06d5d67496" -> null
      - network_border_group = "us-east-1" -> null
      - network_interface    = "eni-0cccca4b8d888123b" -> null
      - private_dns          = "ip-10-0-75-157.ec2.internal" -> null
      - private_ip           = "10.0.75.157" -> null
      - public_dns           = "ec2-18-213-142-50.compute-1.amazonaws.com" -> null
      - public_ip            = "18.213.142.50" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "restaurant-eit"
        } -> null
      - tags_all             = {
          - "Name" = "restaurant-eit"
        } -> null
      - vpc                  = true -> null
    }

  # aws_iam_policy.iam_policy_for_lambda will be created
  + resource "aws_iam_policy" "iam_policy_for_lambda" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for managing aws lambda role"
      + id          = (known after apply)
      + name        = "aws_iam_policy_for_terraform_aws_lambda_role"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.ecs_task_execution_role will be destroyed
  # (because aws_iam_role.ecs_task_execution_role is not in configuration)
  - resource "aws_iam_role" "ecs_task_execution_role" {
      - arn                   = "arn:aws:iam::731771597147:role/restaurant-ecsTaskExecutionRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-11-05T18:24:04Z" -> null
      - force_detach_policies = false -> null
      - id                    = "restaurant-ecsTaskExecutionRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "restaurant-ecsTaskExecutionRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA2UYH4OFN2VMCBZBJM" -> null
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "restaurant_auth"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role will be created
  + resource "aws_iam_role_policy_attachment" "attach_iam_policy_to_iam_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "restaurant_auth"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution_role_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      - id         = "restaurant-ecsTaskExecutionRole-20231105182404470200000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "restaurant-ecsTaskExecutionRole" -> null
    }

  # aws_internet_gateway.igw will be destroyed
  # (because aws_internet_gateway.igw is not in configuration)
  - resource "aws_internet_gateway" "igw" {
      - arn      = "arn:aws:ec2:us-east-1:731771597147:internet-gateway/igw-0c680a06ddaea0086" -> null
      - id       = "igw-0c680a06ddaea0086" -> null
      - owner_id = "731771597147" -> null
      - tags     = {
          - "Name" = "restaurant-igw"
        } -> null
      - tags_all = {
          - "Name" = "restaurant-igw"
        } -> null
      - vpc_id   = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_lambda_function.terraform_lambda_func will be created
  + resource "aws_lambda_function" "terraform_lambda_func" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./tfgenerated/auth.zip"
      + function_name                  = "restaurant_auth"
      + handler                        = "authorizer"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "/6YZpvq0aBTzG51oQS+soEIfDrLkOu4a+9FMze4SnPY="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # aws_lb.this will be destroyed
  # (because aws_lb.this is not in configuration)
  - resource "aws_lb" "this" {
      - arn                                         = "arn:aws:elasticloadbalancing:us-east-1:731771597147:loadbalancer/app/restaurant-alb/abeaa18aec9b0d35" -> null
      - arn_suffix                                  = "app/restaurant-alb/abeaa18aec9b0d35" -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "restaurant-alb-1276276083.us-east-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:us-east-1:731771597147:loadbalancer/app/restaurant-alb/abeaa18aec9b0d35" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "restaurant-alb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-0bc6b3e1d0c9a4da8",
        ] -> null
      - subnets                                     = [
          - "subnet-0284ab38624aef72e",
          - "subnet-048a01da1eaaa9627",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-02f62adc57a97cda4" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z35SXDOTRQ7X7K" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0284ab38624aef72e" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-048a01da1eaaa9627" -> null
        }
    }

  # aws_lb_listener.this will be destroyed
  # (because aws_lb_listener.this is not in configuration)
  - resource "aws_lb_listener" "this" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-1:731771597147:listener/app/restaurant-alb/abeaa18aec9b0d35/892a6f12ea76dd03" -> null
      - id                = "arn:aws:elasticloadbalancing:us-east-1:731771597147:listener/app/restaurant-alb/abeaa18aec9b0d35/892a6f12ea76dd03" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:731771597147:loadbalancer/app/restaurant-alb/abeaa18aec9b0d35" -> null
      - port              = 8080 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:731771597147:targetgroup/alb-target-gp/95b7466237ec27d7" -> null
          - type             = "forward" -> null
        }
    }

  # aws_lb_target_group.this will be destroyed
  # (because aws_lb_target_group.this is not in configuration)
  - resource "aws_lb_target_group" "this" {
      - arn                                = "arn:aws:elasticloadbalancing:us-east-1:731771597147:targetgroup/alb-target-gp/95b7466237ec27d7" -> null
      - arn_suffix                         = "targetgroup/alb-target-gp/95b7466237ec27d7" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:us-east-1:731771597147:targetgroup/alb-target-gp/95b7466237ec27d7" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "alb-target-gp" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-02f62adc57a97cda4" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200,301,302" -> null
          - path                = "/api/v1/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 5 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_health_state {}
    }

  # aws_nat_gateway.nat will be destroyed
  # (because aws_nat_gateway.nat is not in configuration)
  - resource "aws_nat_gateway" "nat" {
      - allocation_id                      = "eipalloc-00676bf06d5d67496" -> null
      - association_id                     = "eipassoc-0cf520b044cfaa1ed" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-098a61e6017d8e254" -> null
      - network_interface_id               = "eni-0cccca4b8d888123b" -> null
      - private_ip                         = "10.0.75.157" -> null
      - public_ip                          = "18.213.142.50" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-048a01da1eaaa9627" -> null
      - tags                               = {
          - "Name" = "restaurant-nat"
        } -> null
      - tags_all                           = {
          - "Name" = "restaurant-nat"
        } -> null
    }

  # aws_route_table.private will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:731771597147:route-table/rtb-09afe03b2ce6656fe" -> null
      - id               = "rtb-09afe03b2ce6656fe" -> null
      - owner_id         = "731771597147" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-098a61e6017d8e254"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "private"
        } -> null
      - tags_all         = {
          - "Name" = "private"
        } -> null
      - vpc_id           = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_route_table.public will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:731771597147:route-table/rtb-0ef554af3a7623de7" -> null
      - id               = "rtb-0ef554af3a7623de7" -> null
      - owner_id         = "731771597147" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0c680a06ddaea0086"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "public"
        } -> null
      - tags_all         = {
          - "Name" = "public"
        } -> null
      - vpc_id           = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_route_table_association.private-us-east-1a will be destroyed
  # (because aws_route_table_association.private-us-east-1a is not in configuration)
  - resource "aws_route_table_association" "private-us-east-1a" {
      - id             = "rtbassoc-02b441d933cd3f75e" -> null
      - route_table_id = "rtb-09afe03b2ce6656fe" -> null
      - subnet_id      = "subnet-0c547afae8ab7bc81" -> null
    }

  # aws_route_table_association.private-us-east-1b will be destroyed
  # (because aws_route_table_association.private-us-east-1b is not in configuration)
  - resource "aws_route_table_association" "private-us-east-1b" {
      - id             = "rtbassoc-090204f224b6a5312" -> null
      - route_table_id = "rtb-09afe03b2ce6656fe" -> null
      - subnet_id      = "subnet-081509cef4e929d47" -> null
    }

  # aws_route_table_association.public-us-east-1a will be destroyed
  # (because aws_route_table_association.public-us-east-1a is not in configuration)
  - resource "aws_route_table_association" "public-us-east-1a" {
      - id             = "rtbassoc-099f2c4e17293d387" -> null
      - route_table_id = "rtb-0ef554af3a7623de7" -> null
      - subnet_id      = "subnet-048a01da1eaaa9627" -> null
    }

  # aws_route_table_association.public-us-east-1b will be destroyed
  # (because aws_route_table_association.public-us-east-1b is not in configuration)
  - resource "aws_route_table_association" "public-us-east-1b" {
      - id             = "rtbassoc-0a9a82ca51b57ba89" -> null
      - route_table_id = "rtb-0ef554af3a7623de7" -> null
      - subnet_id      = "subnet-0284ab38624aef72e" -> null
    }

  # aws_security_group.alb_sg will be destroyed
  # (because aws_security_group.alb_sg is not in configuration)
  - resource "aws_security_group" "alb_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:731771597147:security-group/sg-0bc6b3e1d0c9a4da8" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0bc6b3e1d0c9a4da8" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
        ] -> null
      - name                   = "restaurant-alb-sg" -> null
      - owner_id               = "731771597147" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_security_group.service_sg will be destroyed
  # (because aws_security_group.service_sg is not in configuration)
  - resource "aws_security_group" "service_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:731771597147:security-group/sg-02906763fc02f0428" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-02906763fc02f0428" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0bc6b3e1d0c9a4da8",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "restaurant-service-sg" -> null
      - owner_id               = "731771597147" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_service_discovery_http_namespace.this will be destroyed
  # (because aws_service_discovery_http_namespace.this is not in configuration)
  - resource "aws_service_discovery_http_namespace" "this" {
      - arn         = "arn:aws:servicediscovery:us-east-1:731771597147:namespace/ns-5sof4ijobvtuqbhf" -> null
      - description = "Namespace para descoberta dos services do ECS" -> null
      - http_name   = "restaurant-ecs-services" -> null
      - id          = "ns-5sof4ijobvtuqbhf" -> null
      - name        = "restaurant-ecs-services" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_subnet.private-us-east-1a will be destroyed
  # (because aws_subnet.private-us-east-1a is not in configuration)
  - resource "aws_subnet" "private-us-east-1a" {
      - arn                                            = "arn:aws:ec2:us-east-1:731771597147:subnet/subnet-0c547afae8ab7bc81" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.0.0/19" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0c547afae8ab7bc81" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "731771597147" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "private-us-east-1a"
        } -> null
      - tags_all                                       = {
          - "Name" = "private-us-east-1a"
        } -> null
      - vpc_id                                         = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_subnet.private-us-east-1b will be destroyed
  # (because aws_subnet.private-us-east-1b is not in configuration)
  - resource "aws_subnet" "private-us-east-1b" {
      - arn                                            = "arn:aws:ec2:us-east-1:731771597147:subnet/subnet-081509cef4e929d47" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.32.0/19" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-081509cef4e929d47" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "731771597147" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "private-us-east-1b"
        } -> null
      - tags_all                                       = {
          - "Name" = "private-us-east-1b"
        } -> null
      - vpc_id                                         = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_subnet.public-us-east-1a will be destroyed
  # (because aws_subnet.public-us-east-1a is not in configuration)
  - resource "aws_subnet" "public-us-east-1a" {
      - arn                                            = "arn:aws:ec2:us-east-1:731771597147:subnet/subnet-048a01da1eaaa9627" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.64.0/19" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-048a01da1eaaa9627" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "731771597147" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "public-us-east-1a"
        } -> null
      - tags_all                                       = {
          - "Name" = "public-us-east-1a"
        } -> null
      - vpc_id                                         = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_subnet.public-us-east-1b will be destroyed
  # (because aws_subnet.public-us-east-1b is not in configuration)
  - resource "aws_subnet" "public-us-east-1b" {
      - arn                                            = "arn:aws:ec2:us-east-1:731771597147:subnet/subnet-0284ab38624aef72e" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.96.0/19" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0284ab38624aef72e" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "731771597147" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "public-us-east-1b"
        } -> null
      - tags_all                                       = {
          - "Name" = "public-us-east-1b"
        } -> null
      - vpc_id                                         = "vpc-02f62adc57a97cda4" -> null
    }

  # aws_vpc.main will be destroyed
  # (because aws_vpc.main is not in configuration)
  - resource "aws_vpc" "main" {
      - arn                                  = "arn:aws:ec2:us-east-1:731771597147:vpc/vpc-02f62adc57a97cda4" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0014adcc6050f080d" -> null
      - default_route_table_id               = "rtb-0e31cfe169c8c2f1b" -> null
      - default_security_group_id            = "sg-0a04a9bbaf7b6d2e6" -> null
      - dhcp_options_id                      = "dopt-0f6f16d85ceaa70d3" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-02f62adc57a97cda4" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0e31cfe169c8c2f1b" -> null
      - owner_id                             = "731771597147" -> null
      - tags                                 = {
          - "Name" = "restaurant-vpc"
        } -> null
      - tags_all                             = {
          - "Name" = "restaurant-vpc"
        } -> null
    }

Plan: 4 to add, 0 to change, 28 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @danilo-ac, Action: `pull_request`*